tutorials/multiBeam/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam1 beam2);

//- static heat source with a gaussian distribution
beam1
{
    pathName            scanPath_1;
 
    absorptionModel     constant;    
    constantCoeffs
    {
        eta             0.35;
    }   

    heatSourceModel     superGaussian;
    superGaussianCoeffs
    {
        dimensions      (85.0e-6 85.0e-6 30e-6);
        k               2.0;
        transient       false;
    }
}

//- transient heat source with a modified super-gaussian distribution
beam2
{
    pathName            scanPath_2;
 
    absorptionModel     Kelly;    
    KellyCoeffs
    {
        geometry        cylinder;
        eta0            0.3;
        etaMin          0.35;
    }   

    heatSourceModel     modifiedSuperGaussian;
    modifiedSuperGaussianCoeffs
    {
        dimensions      (50.0e-6 50.0e-6 30e-6);
        m               2.0;
        k               2.0;
        transient       true;
        isoValue        1410;
    }
}

// ************************************************************************* //
