tutorials/multiBeam/constant/scanPath_1
Mode    X       Y       Z   Power   Param
1       0.000   -10e-5   0   0       0
0       0.002   -10e-5   0   179.2   0.8
